Tekla Open API Reference for Tekla Structures 2025
ModelHistory.GetModifications Method
Overload List
Name | Description
GetModifications(String, ModificationStamp)
Lookup modifications since previous call of TakeModifications() without resetting the modstamp
GetModifications(String, IEnumerable<ModelObject.ModelObjectEnum>, ModificationStamp)
Lookup modifications since previous call of TakeModifications() without resetting the modstamp, with object type filtering
Top
See Also
Reference
ModelHistory Class
Tekla.Structures.Model.History Namespace